/*******************************************************************************
* @FileName: MB.c
* @Author: WHP
* @Version: 2.20
* @Date:
* @Brief:
* @Others: 要修改此文件时，请谨慎再谨慎
********************************************************************************
* @Function List: 
*  1. Modbus 帧间隔时间计算
*     uint32_t Modbus_T35_50us(uint32_t baudrate)
*  2. 
*
********************************************************************************
* @History:
*  1. Date:  
*  Author:
*  Modification:
*  
*  2. ...
*
*******************************************************************************/

#include "mb.h"

/****************** 通讯规约属性 **********************************************/
/* 通讯-通讯协议版本号 */
const uint16_t ProtocolVersion[6]={'P','V','2','.','2','0'}; 
/****************** End of 通讯规约属性 ***************************************/


/**
@Function: uint32_t Modbus_T35_50us(uint32_t Baudrate)
@Brief: Modbus 帧间隔时间计算，返回值是50us的倍数
@Calls: None
@Called By: None
@Input: baudrate: 波特率
@Output: 
@Return: Modbus 帧间隔的时间，50us的倍数
@Others: None
**/
uint32_t Modbus_T35_50us(uint32_t baudrate)
{
	uint32_t T35_50us; /* 50us计数器 */

	/*
	如果波特率大于19200 pbs，必须使用固定时间（1750us）；
	否则，时间间隔必须为3.5个字符的传输时间
	*/
	if (baudrate > 19200)
	{
		T35_50us = 35; /* 35 * 50us = 1750us */		
	}
	else
	{
		/* 一个字节的传输时间可以如下计算
		*  t = 1s / （Baudrate / 11）
		*    = 1s * 11 / Baudrate
		*  ① ModBus-RTU 的一个字符包含1位起始位、8位数据位、2位停止位
		*  ② Modbus帧结束时间为3.5个字节
		*/
		
		/* a、20000 * 50us=1s; b、7/2=3.5，避免浮点数运算 */ 
		T35_50us = (7 * 20000 * 11) / (2 * baudrate);
	}

	return T35_50us;
}				

/************************************************************** end of file ***/
